// 3. Напишите программу на JavaScript, которая создаст кнопку на вашей веб-странице. При нажатии на эту кнопку должно открываться новое окно или модальное диалоговое окно для регистрации пользователя. Форма регистрации должна включать следующие поля ввода:
// Полное имя (текстовое поле)
// Адрес электронной почты (поле для ввода email)
// Пароль (поле для ввода пароля)
// Подтверждение пароля (поле для ввода пароля)
// Добавьте кнопку «Отправить» в форму. Используйте CSS для стилизации кнопки, полей ввода формы и всего окна регистрации, чтобы интерфейс был удобным и привлекательным._

const btn = document.getElementById("btn")
const form = document.getElementById("form")

btn.addEventListener("click", () => {
    form.classList.toggle("hidden")
})